---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.#ctor
source: html/98159079-24c0-ac32-04f1-443f2d9616c4.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.#ctor Method

Constructs a settings object with default values.

## Syntax (C#)
```csharp
public PointCloudOverrideSettings()
```